<?php


return [

    /*
    |--------------------------------------------------------------------------
    | customized http code
    |--------------------------------------------------------------------------
    |
    | The first number is error type, the second and third number is
    | product type, and it is a specific error code from fourth to
    | sixth.But the success is different.
    |
    */

    'code' => [
        0 => '成功',
        1000 =>'失败',
        200001 => '缺少必要的参数',
        200002=>'账号或密码错误',
        200003=>'原密码与现密码一致',
        200004=>'原密码错误',
        1001=>'登录状态失效的状态码',
        //文章
        503001 => '上传文件的格式不正确',
        503002 => '同步成功-记录保存失败',
        503003 => '权限错误',
        503004 => '文章保存失败', 
        403017 => '临近定时时间不能取消发送任务',
        403018 => '临近定时时间不能修改发送任务',
        403019 => '超过发送时间不能发送',
        403020 => '缺少发表记录ID参数',
        //SMS
        416001 => '添加成功,审核中,请耐心等待',
        416002 => '签名添加失败',
        500000 => '非法请求',
        600000 => '服务器错误，请联系管理员!',
        700000 => '缺少会议ID!',
    ],

];
